Repository: GalaxyGamingBoy/flutter-thunder-calculator
Catalog: lib/l10n/app_*.arb
Languages: el

# title
source: Thunder Calculator
el: Υπολογισμός Κεραυνού

# settingsTitle
source: Settings
el: Ρυθμίσεις

# stopwatchStart
source: Start
el: Έναρξη

# stopwatchEnd
source: Stop & Record Time
el: Διακοπή & καταγραφή χρόνου

# stopwatchSegmentTitle
source: STOPWATCH
el: Χρονόμετρο

# timeMeasuredSegmentTitle
source: TIME MEASURED
el: ΧΡΟΝΟΣ ΜΕΤΡΗΣΗΣ

source: Change
el: Αλλαγή

# distanceSegmentTitle
source: DISTANCE
el: ΑΠΟΣΤΑΣΗ

# distanceTypeKM
source: km
el: χλμ

# distanceTypeMI
source: mi
el: μίλια

# systemOfMeasurementSegmentSettingsTitle
source: SYSTEM OF MEASUREMENT
el: ΣΥΣΤΗΜΑ ΜΕΤΡΗΣΕΩΝ

source: Current
el: Τρέχον

# systemOfMeasurementMetric
source: Metric
el: Μετρικό ( SI )

# systemOfMeasurementImperial
source: Metric
el: Ιμπέριαλ ( USA )

source: Save
el: Αποθήκευση

# helpSegmentTitle
source: Help
el: Βοήθεια

# helpParagraphA
source: This is a simple app I made that calculates the distance of a lighting strike, by measuring the time it takes you to hear the thunder by the time you see it. For you to calculate the distance you have 2 ways.
el: Αυτή είναι μια απλή εφαρμογή που έφτιαξα και υπολογίζει την απόσταση ενός κεραυνού, μετρώντας το χρόνο από την στιγμή που ακούτε έναν κεραυνό έως την στιγμή που θα τον δείτε. Για να υπολογίσετε την απόσταση υπάρχουν 2 τρόποι.

# helpParagraphB
source: The first is to click the "Start" button on the stopwatch when you see the lighting and click "Stop & Record Time" when you hear the sound. You should have the distance shown in the bottom.
el: Η πρώτη είναι να κάνετε κλικ στο κουμπί "Έναρξη" στο χρονόμετρο όταν βλέπετε τον κεραυνό και κάντε κλικ στο κουμπί "Διακοπή και καταγραφή χρόνου" όταν ακούσετε τον ήχο. Θα πρέπει να εμφανίζεται η απόσταση στην ενότητα ΑΠΟΣΤΑΣΗ.

# helpParagraphC
source: The second one is to count yourself the time it takes from the moment you see the thunder to the moment you hear it. After counting the seconds or minutes, input it on the "TIME MEASURED" section. You should have the distance shown in the bottom.
el: Η δεύτερη είναι να μετράτε τον χρόνο που χρειάζεται από τη στιγμή που θα δείτε τη βροντή μέχρι τη στιγμή που θα την ακούσετε. Αφού μετρήσετε τα δευτερόλεπτα ή τα λεπτά, εισαγάγετε τα στην ενότητα "ΧΡΟΝΟΣ ΜΕΤΡΗΣΗΣ". Θα πρέπει να εμφανίζεται η απόσταση στην ενότητα ΑΠΟΣΤΑΣΗ.

source: More
el: Περισσότερα

source: Back
el: Πίσω

# moreInfoParagraphA
source: EXTRA TIPS: You can change the "TIME MEASURED" Input to be seconds or minutes by clicking the button on the right labelled "Sec | Change" or "Min | Change" respectively. The "Sec" or "Min" Label of the button before the " | Change" label shows the current format. ("Sec": "Second" and "Min": "Minute")
el: ΕΠΙΠΛΈΟΝΕΣ ΣΥΜΒΟΥΛΕΣ: Μπορείτε να αλλάξετε την είσοδο "ΧΡΟΝΟΣ ΜΕΤΡΗΣΗΣ" σε δευτερόλεπτα ή λεπτά κάνοντας κλικ στο κουμπί στα δεξιά με την ένδειξη "Sec | Αλλαγή" ή "Min | Αλλαγή" αντίστοιχα. ("Sec": "δευτερόλεπτο" και "Min": "λεπτό")

# madeBy
source: Made by: GalaxyGamingBoy
el: Δημιουργήθηκε από: GalaxyGamingBoy

# translatedBy
source: Translated by: GalaxyGamingBoy
el: Μεταφράστηκε από: GalaxyGamingBoy

source: Version
el: Εκδοση
